app/controllers/reports_controller.rb

	def create
			report = current_user.reports.build(reports_params)
		if  report.save
---
INSERT INTO "reports" ("bgl", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["bgl", 1], ["user_id", 1], ["created_at", 2016-06-07 12:15:04 UTC], ["updated_at", 2016-06-07 12:15:04 UTC]]